# Дана строка:
s1 = "Перестановочный алгоритм быстрого действия"
# необходимо вывести все буквы “о” из этой строки.
# Для указанной строки ответ будет “ооооо” (или в столбик)
#
#
print("---------------Задача №1------------------------")

for i in s1:
    if i == 'о':
        print(i, end='')


# Задача №2
#
# Дана строка:
s2 = "Перевыборы выбранного президента"
# необходимо подсчитать количество букв “е” в строке.
# Для указанной строки ответ будет 4.
print()
print("---------------Задача №2------------------------")

counter = 0
for i in s2:
    if 'е' == i:
        counter += 1
print(counter)
print(sum(el == 'е' for el in s2))


#
# Задача №3
#
# Дана строка:
s3 = "Посмотрите как Рите нравится ритм"
# необходимо вывести индексы начала всех подстрок - “рит”, независимо от регистра.
# Для указанной строки ответ будет 6, 15, 29.
#
#
print("---------------Задача №3------------------------")

lower_s = s3.lower()
target = 'рит'
indices = []

for i in range(len(lower_s)):
    if lower_s[i: i + len(target)] == target:
        indices.append(i)

print(indices)
# Экстра задача
#
# Дан список:

ll = [["Привет", "всем", "кто"], ["изучает", "язык", "программирования"], ["java"]]
# необходимо подсчитать количество строк в списке, которые не содержат буквы “е”.
print("---------------Задача Extra------------------------")
counter = 0

for i in ll:
    for j in i:
        if 'е' in j.lower():
            continue
        counter += 1

print(counter)