#
# Задача №1
#
# 0  1  2  3  4  5  6  7  8  9
# 0  1  2  3  4  5  6  7  8
# 0  1  2  3  4  5  6  7
# 0  1  2  3  4  5  6
# 0  1  2  3  4  5
# 0  1  2  3  4
# 0  1  2  3
# 0  1  2
# 0  1
# 0
#

print("---------------Задача №1------------------------")
print()
for i in range(10, 0, -1):
    print()
    # i -= 1
    for j in range(i):
        print(j, end=' ')

#
# Задача №2
#
# 0  1  2  3  4  5  6  7  8  9
#     0  1  2  3  4  5  6  7  8
#         0  1  2  3  4  5  6  7
#              0  1  2  3  4  5  6
#                  0  1  2  3  4  5
#                      0  1  2  3  4
#                          0  1  2  3
#                              0  1  2
#                                  0  1
#                                      0
#

print()
print("---------------Задача №2------------------------")
print()

for i in range(10):
    for space in range(i):
         print('  ', end='')
    for j in range(10-i):
        print(j, end=" ")
    print()

# Задача №3
#
# 9 8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9
#    8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8
#       7 6 5 4 3 2 1 0 1 2 3 4 5 6 7
#          6 5 4 3 2 1 0 1 2 3 4 5 6
#             5 4 3 2 1 0 1 2 3 4 5
#                4 3 2 1 0 1 2 3 4
#                   3 2 1 0 1 2 3
#                      2 1 0 1 2
#                         1 0 1
#                            0
print()
print("---------------Задача №3------------------------")
print()
for i in range(9, -1, -1):
    for space in range(9 - i):
         print('  ', end='')
    for j in range(i, 0, -1):
        print(j, end=" ")
    for k in range(i + 1):
        print(k, end=" ")
    print()

