# Задача №1
#
# Дан список:
l1 = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# необходимо вывести сумму всех значений.
#
print('______________Задача №1_______________З')

print(sum(l1))

total = 0
for i in l1:
    total += i
print(total)

#
# Задача №2
#
# Дан список:
l2 = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# необходимо вывести максимальное значение.
#
print('______________Задача №2_______________З')
print(max(l2))

max = l2[0]
for i in l2:
    if i > max:
        max = i
print(max)

#
# Задача №3
#
# Дан список:
l3 = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# необходимо вывести минимальное значение.
print('______________Задача №3_______________З')

print(min(l3))

min = l3[0]
for i in l3:
    if i < min:
        min = i
print(min)

#
#
# Задача №4
#
# Дан список:
l4 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
# необходимо вывести среднее арифметическое всех значений.

print('______________Задача №4_______________З')
print(sum(l4) / len(l4))

