# Задача №1
#
# Дан список:
# l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# необходимо вывести все нечетные числа из него.
print('Результат задачи 1')
l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
for num in l:
    if num % 2 == 0:
        print(num, end=' ')
print('\nКонец задачи 1')

# Задача №2
#
# Дан список:
# l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# необходимо вывести все значения массива больше 5.
print('Результат задачи 2')
l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
for num in l:
    if num > 5:
         print(num, end=' ')
print('\nКонец задачи 2')

# Задача №3
#
# Дан список:
# l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# необходимо увеличить все значения массива на 15.
print('Результат задачи 3')
l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
for num in l:
    summ = num + 15
    print(summ, end=' ')
print('\nКонец задачи 3')
