# Задача №1
#
# Дан список:
# l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# необходимо вывести сумму всех значений.

print('Результат задачи 1')
l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
total = 0
for num in l:
    total += num
print(total, end=' ')
print('\nКонец задачи 1')
#
# # Задача №2
# #
# # Дан список:
# # l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# # необходимо вывести максимальное значение.
print('Результат задачи 2')
l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
value = l[0]
for num in l:
    if num > value:
        value = num
        print(value, end=' ')
print('\nКонец задачи 2')

# Задача №3
#
# Дан список:
# l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
# необходимо вывести минимальное значение.
print('Результат задачи 3')
l = [9, 2, 6, 4, 5, 12, 7, 8, 6]
value = l[0]
for num in l:
    if num < value:
        value = num
        print(value, end=' ')
print('\nКонец задачи 3')

# Задача №4
#
# Дан список:
# l = [1, 2, 3, 4, 5, 6, 7, 8, 9]
# необходимо вывести среднее арифметическое всех значений.
print('Результат задачи 4')
l = [1, 2, 3, 4, 5, 6, 7, 8, 9]
count = len(l)
total = 0
for num in l:
    total += num
average = total / count
print(average, end=' ')
print('\nКонец задачи 4')
