# Task 1:
# Необходимо вывести числа от 0 до 15.
# for i in range(16):
#     print(i)

# Task 2:
# Необходимо вывести все положительные степени числа 5 которые меньше 10000,
# вывести результат возведения в степень.

# i = 5
# stepen = 5
# pokazatel = 1
# while i < 10000:
#     print(f"Stepen {pokazatel} = {i}")
#     i = i * stepen
#     pokazatel = pokazatel + 1

# Task 3:
# Необходимо вывести все числа кратные 4 между числами 40 и 60 включительно.
# Реализовать 2 варианта:
# использовать конструкцию if для определения кратности (цикл с шагом 1);
# без использования конструкции if (шаг цикла на ваше усмотрение).

# with if
# for i in range(40, 61):
#     if i % 4 == 0:
#         print(i)

# without if
# o = 40
# while 40 <= o <= 60:
#     print(o)
#     o = o + 4

