# Task 1
# Необходимо создать две целочисленные переменные (a, b),
# присвоить произвольные значения переменным на ваш выбор
# и вывести следующие строки:
# a == b - если переменные равны
# a < b - если переменная a меньше b
# a > b - если переменная b меньше a

# a = 25
# b = 5
# if a == b:
#     print('a == b')
# elif a < b:
#     print('a < b')
# else:
#     print('a > b')


# Task 2
# Необходимо создать две целочисленные переменные (a, b),
# присвоить произвольные значения переменным на ваш выбор
# и вывести следующие строки:
# maybe a and b are even - если сумма переменных четная
# some variable is odd - если сумма переменных нечетная

# a = 5
# b = 15
# if (a + b) % 2 == 0:
#     print("maybe a and b are even")
# else:
#     print("some variable is odd")


# Task 3
# Необходимо создать целочисленную переменную,
# присвоить произвольное значение переменной на ваш выбор
# и вывести следующие строки:
# больше 10 - если переменная больше 10
# меньше 100 - если переменная меньше 100
# результат деления на 2 больше 20 - если это соответствует истине
# значение переменной между 5 и 40 включительно - если это правда
# значение переменной меньше 5 или больше 40 - если предыдущие условие ложное

# a = 3
# if a > 10:
#     print("more than 10")
# if a < 100:
#     print("less than 100")
# if a / 2 > 20:
#     print("результат деление на 2 больше 20")
# if 5 <= a <= 40:
#     print("значение переменной между 5 и 40 включительно")
# elif a < 5 or a > 40:
#     print("значение переменной меньше 5 или больше 40")



