#1 Дан список: l1 = [9, 2, 6, 4, 5, 12, 7, 8, 6] необходимо вывести сумму всех значений.

l1 = [9, 2, 6, 4, 5, 12, 7, 8, 6]
total = 0

for i in l1:
   total += i
print(total)

#2 Дан список:l2 = [9, 2, 6, 4, 5, 12, 7, 8, 6] необходимо вывести максимальное значение.

l2 = [9, 2, 6, 4, 5, 12, 7, 8, 6]

print(max(l2))

#3 Дан список: l3 = [9, 2, 6, 4, 5, 12, 7, 8, 6] необходимо вывести минимальное значение.

l3 = [9, 2, 6, 4, 5, 12, 7, 8, 6]

print(min(l3))

#4 Дан список: l4 = [1, 2, 3, 4, 5, 6, 7, 8, 9] необходимо вывести среднее арифметическое всех значений.

l4 = [1, 2, 3, 4, 5, 6, 7, 8, 9]

average = sum(l2) / len(l2)
print(average)